org/index.org
#+TITLE: Emacs Lisp を書いてみたい人へ
#+SETUPFILE: options/default.org
#+OPTIONS: toc:nil num:1

#+BEGIN_HTML
  <script type="text/javascript">
  <!--/*--><![CDATA[/*><!--*/
  $(function() {
    $("pre[id^=ans-]").each(function() {
      var code = $(this);
      var link = $('<a href="javascript:void(0);">toggle code</a>');
      code.hide();
      link.insertBefore(code);
      link.on('click', function(e){code.toggle();});
    });
  });
  /*]]>*///-->
  </script>
#+END_HTML

* 準備 .emacs の設定をしよう
