html/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>Emacs Lisp を書いてみたい人へ</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Yoshinari Nomura" />
<link rel="stylesheet" type="text/css" href="pub/css/text.css" /></head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Emacs Lisp を書いてみたい人へ</h1>
<script type="text/javascript">
<!--/*--><![CDATA[/*><!--*/
$(function() {
  $("pre[id^=ans-]").each(function() {
    var code = $(this);
    var link = $('<a href="javascript:void(0);">toggle code</a>');
    code.hide();
    link.insertBefore(code);
    link.on('click', function(e){code.toggle();});
  });
});
/*]]>*///-->
</script>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 準備 .emacs の設定をしよう</h2>
