org/index.org
** キーバインド
    #+BEGIN_SRC emacs-lisp
      ;; C-h is BS, C-d is DEL
      (load-library "term/bobcat")
      (terminal-init-bobcat)
      (setq normal-erase-is-backspace nil)

      ;; C-zh to help
      (global-unset-key "\C-z")
      (global-set-key "\C-zh" 'help)
      (global-set-key "\C-z\C-z" 'suspend-emacs)
    #+END_SRC

** Emacs Server
   #+BEGIN_SRC emacs-lisp
     (require 'server)

     (unless (server-running-p)
       (server-start))
   #+END_SRC

** cask (package management)
   + https://github.com/cask/cask
   + http://cask.readthedocs.org

   In your terminal:
   #+BEGIN_SRC sh
     curl -fsSL https://raw.githubusercontent.com/cask/cask/master/go | python
   #+END_SRC

   Add to your .zshenv:
   #+BEGIN_SRC shell-script
     path=(~/.cask/bin $path)
   #+END_SRC

   Add to your .emacs:
   #+BEGIN_SRC emacs-lisp
     (require 'cask "~/.cask/cask.el")
     (cask-initialize)
   #+END_SRC

** ヘルプ関連
   #+BEGIN_SRC emacs-lisp
     (add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
     (add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
     (add-hook 'ielm-mode-hook 'eldoc-mode)
     (add-hook 'eval-expression-minibuffer-setup-hook 'eldoc-mode)
     (define-key goto-map "f" 'find-function)
   #+END_SRC

** 便利そうな機能のおさらい
   + M-x toggle-debug-on-error
   + M-x apropos
   + M-x find-function
   + M-x describe-{bindings,function,variable,key}
   + M-x kmacro-start-macro =C-x(=
   + M-x kmacro-{start,end} =C-x(=, =C-x)=

* Emacs Lisp 入門

  この2つを参考に自学してください
  1) [[http://yohshiy.blog.fc2.com/blog-entry-265.html][環境設定のための Emacs Lisp 入門]]
  2) [[http://www.math.s.chiba-u.ac.jp/~matsu/lisp/emacs-lisp-intro-jp_toc.html][Programming in Emacs Lisp]]

* Emacs Lisp で作る前に

  1) 普通の Emacs の使い方をマスタしよう
     + Emacs をある程度使いこなせないなら，Emacs Lisp を書く理由がない
     + 標準機能の改良から初めよう (tetris のキーバインドが気に入らない)

  2) チュートリアルを終えたら，我慢してマニュアルを一通り読もう
     + http://www.gnu.org/software/emacs/manual/elisp.html
     + http://www.bookshelf.jp/texi/elisp-manual/21-2-8/jp/elisp.html (邦訳)
     目を通しておくだけで違う．週末の午後を2日ぐらい使って一通り読むぐらいのイメージ

  3) 何でも Emacs Lisp だけでやろうとしないでいいよ
     + Shell script 書いた方が早くないですか?

     + 他のプロセスやサービスのフロントエンドとして Emacs を使う
       + ispell, flycheck, mew, mhc, jay, grammer.el

     + コマンドラインから emacs server を叩く
       : emacsclient -q -e 'emacs-major-version'

  4) Emacs をむやみに終了しないようにするといいよ
     + 起動に時間がかかる
     + 各種履歴，mark位置，バッファ一覧，scratch等々が消えると面倒

  6) buffer を1つの環境(スコープ，記憶領域，ワークスペース)として利用する
     + ファイルに結び付かないバッファを利用する
     + Emacs の挙動を変える変数は，buffer-local のスコープを持つことが多い
       + 例: truncate-lines
     + *モード* という考え方は，バッファ単位に結び付く
     + 複雑な文字列操作などの場合に裏で一時的なバッファを開いてそこで作業する =with-temp-buffer=

* 小さな elisp 関数の例
