html/index.html

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">キーバインド</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span class="org-comment-delimiter">;; </span><span class="org-comment">C-h is BS, C-d is DEL</span>
(load-library <span class="org-string">"term/bobcat"</span>)
(terminal-init-bobcat)
(setq normal-erase-is-backspace nil)

<span class="org-comment-delimiter">;; </span><span class="org-comment">C-zh to help</span>
(global-unset-key <span class="org-string">"\C-z"</span>)
(global-set-key <span class="org-string">"\C-zh"</span> 'help)
(global-set-key <span class="org-string">"\C-z\C-z"</span> 'suspend-emacs)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Emacs Server</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">server</span>)

(<span class="org-keyword">unless</span> (server-running-p)
  (server-start))
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4">cask (package management)</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li><a href="https://github.com/cask/cask">https://github.com/cask/cask</a>
</li>
<li><a href="http://cask.readthedocs.org">http://cask.readthedocs.org</a>
</li>
</ul>

<p>
In your terminal:
</p>
<div class="org-src-container">

<pre class="src src-sh">curl -fsSL https://raw.githubusercontent.com/cask/cask/master/go | python
</pre>
</div>

<p>
Add to your .zshenv:
</p>
<div class="org-src-container">

<pre class="src src-shell-script"><span class="org-variable-name">path</span>=(~/.cask/bin $<span class="org-variable-name">path</span>)
</pre>
</div>

<p>
Add to your .emacs:
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">require</span> '<span class="org-constant">cask</span> <span class="org-string">"~/.cask/cask.el"</span>)
(cask-initialize)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5">ヘルプ関連</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(add-hook 'emacs-lisp-mode-hook 'eldoc-mode)
(add-hook 'lisp-interaction-mode-hook 'eldoc-mode)
(add-hook 'ielm-mode-hook 'eldoc-mode)
(add-hook 'eval-expression-minibuffer-setup-hook 'eldoc-mode)
(define-key goto-map <span class="org-string">"f"</span> 'find-function)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6">便利そうな機能のおさらい</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>M-x toggle-debug-on-error
</li>
<li>M-x apropos
</li>
<li>M-x find-function
</li>
<li>M-x describe-{bindings,function,variable,key}
</li>
<li>M-x kmacro-start-macro <code>C-x(</code>
</li>
<li>M-x kmacro-{start,end} <code>C-x(</code>, <code>C-x)</code>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Emacs Lisp 入門</h2>
<div class="outline-text-2" id="text-2">
<p>
この2つを参考に自学してください
</p>
<ol class="org-ol">
<li><a href="http://yohshiy.blog.fc2.com/blog-entry-265.html">環境設定のための Emacs Lisp 入門</a>
</li>
<li><a href="http://www.math.s.chiba-u.ac.jp/~matsu/lisp/emacs-lisp-intro-jp_toc.html">Programming in Emacs Lisp</a>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Emacs Lisp で作る前に</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>普通の Emacs の使い方をマスタしよう
<ul class="org-ul">
<li>Emacs をある程度使いこなせないなら，Emacs Lisp を書く理由がない
</li>
<li>標準機能の改良から初めよう (tetris のキーバインドが気に入らない)
</li>
</ul>
</li>

<li>チュートリアルを終えたら，我慢してマニュアルを一通り読もう
<ul class="org-ul">
<li><a href="http://www.gnu.org/software/emacs/manual/elisp.html">http://www.gnu.org/software/emacs/manual/elisp.html</a>
</li>
<li><a href="http://www.bookshelf.jp/texi/elisp-manual/21-2-8/jp/elisp.html">http://www.bookshelf.jp/texi/elisp-manual/21-2-8/jp/elisp.html</a> (邦訳)
</li>
</ul>
<p>
目を通しておくだけで違う．週末の午後を2日ぐら使って一通り読むぐらいのイメージ
</p>
</li>

<li>何でも Emacs Lisp だけでやろうとしないでいいよ
<ul class="org-ul">
<li>Shell script 書いた方が早くないですか?
</li>

<li>他のプロセスやサービスのフロントエンドとして Emacs を使う
<ul class="org-ul">
<li>ispell, flycheck, mew, mhc, jay, grammer.el
</li>
</ul>
</li>

<li>コマンドラインから emacs server を叩く
<pre class="example">
emacsclient -q -e 'emacs-major-version'
</pre>
</li>
</ul>
</li>

<li>Emacs をむやみに終了しないようにするといいよ
<ul class="org-ul">
<li>起動に時間がかかる
</li>
<li>各種履歴，mark位置，バッファ一覧，scratch等々が消えると面倒
</li>
</ul>
</li>

<li>buffer を1つの環境(スコープ，記憶領域，ワークスペース)として利用する
<ul class="org-ul">
<li>ファイルに結び付かないバッファを利用する
</li>
<li>Emacs の挙動を変える変数は，buffer-local のスコープを持つことが多い
<ul class="org-ul">
<li>例: truncate-lines
</li>
</ul>
</li>
<li><b>モード</b> という考え方は，バッファ単位に結び付く
</li>
<li>複雑な文字列操作などの場合に裏で一時的なバッファを開いてそこで作業する <code>with-temp-buffer</code>
</li>
</ul>
</li>
</ol>
</div>
</div>
