org/index.org
** todo, address, memo
   特定のディレクトリにある特定のファイルを開くだけの単純な関数である．
   常に書き足したり参照するファイルがあり，find-file するのが面倒な場合に重宝する．
   path を制御する変数は以下の通り:

   + mydocument-path :: 一連のファイルを置いてあるディレクトリ．デフォルトは "~/prj/private/"
   + todo-file-name, memo-file-name, address-file-name :: それぞれのファイル名．デフォルトは、"TODO", "MEMO", "ADDRESS"

** sum-rectangle, sum-region
   あるリージョンに入っている数の合計を計算して，バッファに挿入する関数．

   #+BEGIN_EXAMPLE
     リンゴ  100
     スイカ  200
     ミカン  300
   #+END_EXAMPLE

   のようなバッファで、1 の所にマークを付けて，300 の後ろにポインタを置く．
   そこで， =M-x sum-rectangle= を実行すると，[合計: 600] を挿入する．
   =sum-region= は，矩形ではなく，リージョンについて，同様の事を行う．

** make-timetable
   発表会の準備をする場合，時間を計算しながらタイムテーブルを書くことがよくある．
   たとえば，以下のようなテーブルである．

   #+BEGIN_EXAMPLE
     14:00-14:40 発表1 (D1)
     14:40-15:20 発表2 (D1)

     15:20-15:45 発表3 (M2)
     15:45-16:10 発表4 (M2)
     16:10-16:35 発表5 (M2)
     16:35-17:00 発表6 (M2)
   #+END_EXAMPLE

    人数や順番の変更，1人当りの時間が変更されると，再度計算が必要になる．
    これは，面倒なだけでなく，間違いが発生する原因になる．

    M2 の持ち時間が、20分に変更になったとしよう．
    *15:20* の *1* の上にポインタを置いて， =M-x make-timetable= を叩く．
    =Frequency:= と =Interval:= 聞かれるので，20 と 0 と答えると， M2 の時間が

    #+BEGIN_EXAMPLE
      15:20-15:40 発表3 (M2)
      15:40-16:00 発表4 (M2)
      16:00-16:20 発表5 (M2)
      16:20-16:40 発表6 (M2)
    #+END_EXAMPLE

    のように書換えられる．開始時間を変えたければ，
    15:20 をあらかじめ書換えておけばいい．Interval を指定すると，発表間にその分のギャップを入れられる．

    最初にテーブルを作るときは，開始時間だけ埋めて，あとは 00:00 とでもしておけばよい．
    上の例では，「D1」の後に空行を挿入してある．
    これは，D1の時間だけを書換えたいのに M2 まで変わってしまわないようにするためである．

* (番外) セルの話
** (cons 'a 'b) と (cons 'a '(b)) の違いは何か

   =[ptr1 . ptr2]= の形をセルという． =(cons x y)= とは，新たなセルを1つ作って， =ptr1= を =x= に =ptr2= を =y= に向けること．

   #+BEGIN_EXAMPLE
     1. (cons 'a 'b):    [ptr1 . ptr2] -> b
                           |
                           a


     2. (cons 'a '(b)):  [ptr1 . ptr2] -> [pt1 . ptr2] -> nil
                           |                |
                           a                b

     3. '(b):            [ptr1 . ptr2] -> nil
                           |
                           b
   #+END_EXAMPLE

   1 は単に 2つをオブジェクトを格納する二股ポインタ． =(a . b)= と表記する．
   2 はリスト構造を持っている． =(a b)= と表記する．
   =ptr1= の指すオブジェクトを =car=, =ptr2= の指すオブジェクト cdr と呼ぶ．
   =ptr= が指す先がセルでないとき，たとえば =x= や =1= のようなとき，=ptr1= は，atom であるという．

** セルの操作の図解
*** 前に足す
    #+BEGIN_EXAMPLE
       (setq xxx '(a b c))
       (setq yyy (cons 'x xxx)) ;; セルを1つ足して cdr を xxx に

       このときのオブジェクトの様子:
                      xxx
                       |
                       v
       yyy -> [x . ->] [a . ->] [b . ->] [c . nil]

       注意: cons cell 中に直接 x が入っているように略記している．
    #+END_EXAMPLE

*** 途中をいじる
    #+BEGIN_EXAMPLE
       (setcar (nthcdr 2 xxx) 'x)  ;; xxxリストの2番目のcarをxに変える

       xxx -> [a . ->] [b . ->] [x . nil]
                 0        1        2
    #+END_EXAMPLE

*** 後に足す

    #+BEGIN_EXAMPLE
      (setcdr (nthcdr 2 xxx) (cons 'y nil)) ;; セルを1つ足して2のcdrを
                                            ;; それに向ける

      xxx -> [a . ->] [b . ->] [c . ->] [y . nil]
                0        1        2
    #+END_EXAMPLE

*** 反転を2回して後に足す
    #+BEGIN_EXAMPLE
      (nreverse (cons 'x (nreverse xxx)))

      [a . ->] [b . ->] [c . nil]
      [a . nil] [b . <-] [c . <-]
      [a . nil] [b . <-] [c . <-] [ x . <-]
      [a . ->] [b . ->] [c . ->] [ x . nil]
    #+END_EXAMPLE
