html/index.html


<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2">todo, address, memo</h3>
<div class="outline-text-3" id="text-4-2">
<p>
特定のディレクトリにある特定のファイルを開くだけの単純な関数である．
常に書き足したり参照するファイルがあり，find-file するのが面倒な場合に重宝する．
path を制御する変数は以下の通り:
</p>

<dl class="org-dl">
<dt> mydocument-path </dt><dd>一連のファイルを置いてあるディレクトリ．デフォルトは "~/prj/private/"
</dd>
<dt> todo-file-name, memo-file-name, address-file-name </dt><dd>それぞれのファイル名．デフォルトは、"TODO", "MEMO", "ADDRESS"
</dd>
</dl>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3">sum-rectangle, sum-region</h3>
<div class="outline-text-3" id="text-4-3">
<p>
あるリージョンに入っている数の合計を計算して，バッファに挿入する関数．
</p>

<pre class="example">
     リンゴ  100
     スイカ  200
     ミカン  300
</pre>

<p>
のようなバッファで、1 の所にマークを付けて，300 の後ろにポインタを置く．
そこで， <code>M-x sum-rectangle</code> を実行すると，[合計: 600] を挿入する．
<code>sum-region</code> は，矩形ではなく，リージョンについて，同様の事を行う．
</p>
</div>
</div>

<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4">make-timetable</h3>
<div class="outline-text-3" id="text-4-4">
<p>
発表会の準備をする場合，時間を計算しながらタイムテーブルを書くことがよくある．
たとえば，以下のようなテーブルである．
</p>

<pre class="example">
14:00-14:40 発表1 (D1)
14:40-15:20 発表2 (D1)

15:20-15:45 発表3 (M2)
15:45-16:10 発表4 (M2)
16:10-16:35 発表5 (M2)
16:35-17:00 発表6 (M2)
</pre>

<p>
人数や順番の変更，1人当りの時間が変更されると，再度計算が必要になる．
これは，面倒なだけでなく，間違いが発生する原因になる．
</p>

<p>
M2 の持ち時間が、20分に変更になったとしよう．
<b>15:20</b> の <b>1</b> の上にポインタを置いて， <code>M-x make-timetable</code> を叩く．
<code>Frequency:</code> と <code>Interval:</code> 聞かれるので，20 と 0 と答えると， M2 の時間が
</p>

<pre class="example">
15:20-15:40 発表3 (M2)
15:40-16:00 発表4 (M2)
16:00-16:20 発表5 (M2)
16:20-16:40 発表6 (M2)
</pre>

<p>
のように書換えられる．開始時間を変えたければ，
15:20 をあらかじめ書換えておけばいい．Interval を指定すると，発表間にその分のギャップを入れられる．
</p>

<p>
最初にテーブルを作るときは，開始時間だけ埋めて，あとは 00:00 とでもしておけばよい．
上の例では，「D1」の後に空行を挿入してある．
これは，D1の時間だけを書換えたいのに M2 まで変わってしまわないようにするためである．
</p>
</div>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> (番外) セルの話</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">(cons 'a 'b) と (cons 'a '(b)) の違いは何か</h3>
<div class="outline-text-3" id="text-5-1">
<p>
<code>[ptr1 . ptr2]</code> の形をセルという． <code>(cons x y)</code> とは，新たなセルを1つ作って， <code>ptr1</code> を <code>x</code> に <code>ptr2</code> を <code>y</code> に向けること．
</p>

<pre class="example">
1. (cons 'a 'b):    [ptr1 . ptr2] -&gt; b
                      |
                      a


2. (cons 'a '(b)):  [ptr1 . ptr2] -&gt; [pt1 . ptr2] -&gt; nil
                      |                |
                      a                b

3. '(b):            [ptr1 . ptr2] -&gt; nil
                      |
                      b
</pre>

<p>
1 は単に 2つをオブジェクトを格納する二股ポインタ． <code>(a . b)</code> と表記する．
2 はリスト構造を持っている． <code>(a b)</code> と表記する．
<code>ptr1</code> の指すオブジェクトを <code>car</code>, <code>ptr2</code> の指すオブジェクト cdr と呼ぶ．
<code>ptr</code> が指す先がセルでないとき，たとえば <code>x</code> や <code>1</code> のようなとき，<code>ptr1</code> は，atom であるという．
</p>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">セルの操作の図解</h3>
<div class="outline-text-3" id="text-5-2">
</div><div id="outline-container-sec-5-2-1" class="outline-4">
<h4 id="sec-5-2-1">前に足す</h4>
<div class="outline-text-4" id="text-5-2-1">
<pre class="example">
(setq xxx '(a b c))
(setq yyy (cons 'x xxx)) ;; セルを1つ足して cdr を xxx に

このときのオブジェクトの様子:
               xxx
                |
                v
yyy -&gt; [x . -&gt;] [a . -&gt;] [b . -&gt;] [c . nil]

注意: cons cell 中に直接 x が入っているように略記している．
</pre>
</div>
</div>

<div id="outline-container-sec-5-2-2" class="outline-4">
<h4 id="sec-5-2-2">途中をいじる</h4>
<div class="outline-text-4" id="text-5-2-2">
<pre class="example">
(setcar (nthcdr 2 xxx) 'x)  ;; xxxリストの2番目のcarをxに変える

xxx -&gt; [a . -&gt;] [b . -&gt;] [x . nil]
          0        1        2
</pre>
</div>
</div>

<div id="outline-container-sec-5-2-3" class="outline-4">
<h4 id="sec-5-2-3">後に足す</h4>
<div class="outline-text-4" id="text-5-2-3">
<pre class="example">
(setcdr (nthcdr 2 xxx) (cons 'y nil)) ;; セルを1つ足して2のcdrを
                                      ;; それに向ける

xxx -&gt; [a . -&gt;] [b . -&gt;] [c . -&gt;] [y . nil]
          0        1        2
</pre>
</div>
</div>

<div id="outline-container-sec-5-2-4" class="outline-4">
<h4 id="sec-5-2-4">反転を2回して後に足す</h4>
<div class="outline-text-4" id="text-5-2-4">
<pre class="example">
(nreverse (cons 'x (nreverse xxx)))

[a . -&gt;] [b . -&gt;] [c . nil]
[a . nil] [b . &lt;-] [c . &lt;-]
[a . nil] [b . &lt;-] [c . &lt;-] [ x . &lt;-]
[a . -&gt;] [b . -&gt;] [c . -&gt;] [ x . nil]
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Yoshinari Nomura</p>
<p class="email">Email: <a href="mailto:nom@quickhack.net">nom@quickhack.net</a></p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.50.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"></p>
</div>
</body>
</html>
